Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1025SG01144.svd
               <register>
                  <name>RXCSRH_PERIPHERAL_EPX_MODE</name>
                  <description>ENDPOINTX Additional Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15</description>
                  <alternateRegister>RXCSRH_HOST_EPX_MODE</alternateRegister>
                  <addressOffset>0x1017</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>INCOMPRX</name>
                        <description>This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete Because Parts Of The Data Were Not Received.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMAREQMODE</name>
                        <description>The CPU Sets This Bit To Select DMA Request Mode</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DISNYET</name>
                        <description>The CPU Sets This Bit To Disable The Sending Of NYET Handshakes</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMAREQENAB</name>
                        <description>The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ISO</name>
                        <description>The CPU Sets This Bit To Enable the RX Endpoint For Isochronous Transfers</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTOCLEAR</name>
                        <description>If The CPU Sets This Bit Then The RxPktRdy Bit Will Be Automatically Cleared Whean A Packet Of RxMaxP Bytes Has Benn Unloaded Froim The Rx FIFO</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXCOUNT</name>
                  <description>ENDPOINTX Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO.</description>
                  <addressOffset>0x1018</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>ENDPOINTRXCOUNT</name>
                        <description>Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TXTYPE</name>
                  <description>ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint</description>
                  <addressOffset>0x101A</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>ENDPOINTNUMBER</name>
                        <description>the cpu should set this value to the endpoint number contained in the tx endpoint descriptor</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>PROTOCOL</name>
                        <description>the cpu should set this to select the required protocol for the tx endpoint 00: control 01: isochronous 10: bulk 11: interrupt</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>PROTOCOLSelect</name>
                           <enumeratedValue>
                              <name>CONTROL</name>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ISOCHRONOUS</name>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BULK</name>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>INTERRUPT</name>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SPEED</name>
                        <description>operating speed of the target device when the core is configured with the multipoint option: 00: unused (note: if selected, the target will be assumed to be using the same connection speed as the core.) 01: high 10: full 11: low</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPEEDSelect</name>
                           <enumeratedValue>
                              <name>HIGH</name>
                              <description>Device In High Speed</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FULL</name>
                              <description>Device In Full Speed</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LOW</name>
                              <description>Device In Low Speed</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TXINTERVAL</name>
                  <description>ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected TX Endpoint.</description>
                  <addressOffset>0x101B</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>TXPOLLINGINTERVAL</name>
                        <description>polling interval</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXTYPE</name>
                  <description>ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint</description>
                  <addressOffset>0x101C</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>ENDPOINTNUMBER</name>
                        <description>the cpu should set this value to the endpoint number contained in the rx endpoint descriptor returned to the musbmhdrc during device enumeration.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>PROTOCOL</name>
                        <description>the cpu should set this to select the required protocol for the rx endpoint 00: control 01: isochronous 10: bulk 11: interrupt</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>PROTOCOLSelect</name>
                           <enumeratedValue>
                              <name>CONTROL</name>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ISOCHRONOUS</name>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BULK</name>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>INTERRUPT</name>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SPEED</name>
                        <description>operating speed of the target device when the core is configured with the multipoint option: 00: unused (note: if selected, the target will be assumed to be using the same connection speed as the core.) 01: high 10: full 11: low</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPEEDSelect</name>
                           <enumeratedValue>
                              <name>UNUSED</name>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HIGH</name>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FULL</name>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LOW</name>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXINTERVAL</name>
                  <description>ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected RX Endpoint.</description>
                  <addressOffset>0x101D</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>RXPOLLINGINTERVAL</name>
                        <description>polling interval</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FIFOSIZE</name>
                  <description>ENDPOINTX Read Only Register That Returns The Sizes Of The FIFO's Associated With The Selected Additional TX/RX Endpoints. INDEX Regsiter should be set 1-15</description>
                  <addressOffset>0x101F</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>TXFIFOSIZE</name>
                        <description>Tx FIFO Size</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RXFIFOSIZE</name>
                        <description>Rx FIFO Size</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>8</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>FIFOX[%s]</name>
                  <description>Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint</description>
                  <addressOffset>0x1020</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>FIFOADDR</name>
                        <description>Writing To These Addresses Loads Data Into The TXFIFO For The Corresponding Endpoint</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DEVCTL</name>
                  <description>Selects Whether The Core Is Operating In Peripheral Or Host Mode</description>
                  <addressOffset>0x1060</addressOffset>
                  <size>8</size>
                  <resetValue>0x80</resetValue>
                  <fields>
                     <field>
                        <name>SESSION</name>
                        <description>when operating as an 'A' device, this bit is set or cleared by CPU to state or end a session. when operating as a 'B' device, this bit is set/cleared by the USBCORE when a session starts/ends</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HOSTREQ</name>
                        <description>when set, the USBCORE will initiate the host negotiation when suspend mode is entered.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HOSTMODE</name>
                        <description>this read-only bit is set when the USBCORE is acting as a host</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>VBUS</name>
                        <description>encoded value for the VBus level</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>VBUSSelect</name>
                           <enumeratedValue>
                              <name>BSESSEND</name>
                              <description>Below SessionEnd</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ASESSEND</name>
                              <description>Above SessionEnd, below AValid</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AAVALID</name>
                              <description>Above AValid, below VBus Valid</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AVBUSVALID</name>
                              <description>Above VBusValid</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LSDEV</name>
                        <description>host mode only: this bit is set when a low speed device has been detected being connected to the port</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FSDEV</name>
                        <description>host mode only: this bit is set when a full or high speed device has been detected being connected to the port</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BDEVICE</name>
                        <description>indicates whether the core is operating as a 'A' device or 'B' device</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MISC</name>
                  <description>RX/TX Early DMA Enable Bits</description>
                  <addressOffset>0x1061</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>RXEDMA</name>
                        <description>DMA_REQ signal for all OUT endpoints will be deasserted based on this bit selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>RXEDMASelect</name>
                           <enumeratedValue>
                              <name>MAXP</name>
                              <description>Dma_req signal for all out endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MAXP_8</name>
                              <description>Dma_req signal for all out endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TXEDMA</name>
                        <description>DMA_REQ signal for all IN endpoints will be deasserted based on this bit selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>TXEDMASelect</name>
                           <enumeratedValue>
                              <name>MAXP</name>
                              <description>Dma_req signal for all in endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MAXP_8</name>
                              <description>Dma_req signal for all in endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
