Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1025SG01144.svd
            <cluster>
               <name>ENDPOINT0</name>
               <description>Endpont 0 is selected</description>
               <alternateCluster>ENDPOINTX</alternateCluster>
               <headerStructName>UsbhsEndpoint0</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>USBHS Control Register A. (All bits except ENABLE and SWRST are Enable protected)</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>USBHS Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>USBHS Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IDVAL</name>
                        <description>Override Valud of ID</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IDOVEN</name>
                        <description>ID Source Select</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>REFCLKSEL</name>
                        <description>Select USB PLL Reference Clock  Speed</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>USBHS Control Register B</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BLANK</name>
                        <description>Blank the wakeup monitoring for a specific real time</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>20</bitWidth>
                        <enumeratedValues>
                           <name>BLANKSelect</name>
                           <enumeratedValue>
                              <name>BLANK0</name>
                              <description>No blank delay</description>
                              <value>0x00000</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BLANKMAX</name>
                              <description>Maximum blank delay</description>
                              <value>0xFFFFF</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLC</name>
                  <description>USBHS Control Register C</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>T1MSEN</name>
                        <description>REFCLK and SUSPENDM override</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>USBHS Interrupt Enable Clear Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>WAKEUP</name>
                        <description>Clear USCORE Detaction Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESUME</name>
                        <description>Clear Resume Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>USB</name>
                        <description>Clear USBCORE General Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMA</name>
                        <description>Clear DMA Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>T1MS</name>
                        <description>Clear T1MS Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PHYRDY</name>
                        <description>Clear PHYRDY Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>USBHS Interrupt Enable Clear Register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>WAKEUP</name>
                        <description>USCORE Detaction Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESUME</name>
                        <description>Resume Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>USB</name>
                        <description>USBCORE General Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMA</name>
                        <description>DMA Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>T1MS</name>
                        <description>T1MS Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PHYRDY</name>
                        <description>PHYRDY Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>USBHS Interrupt Flag Register</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>WAKEUP</name>
                        <description>USB Activity Detection Interrupt</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESUME</name>
                        <description>Resume Interrupt</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>USB</name>
                        <description>USBCORE General Interrupt</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMA</name>
                        <description>DMA Interrupt</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>T1MS</name>
                        <description>Timer 1ms Tick Interrupt</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PHYRDY</name>
                        <description>PHY Ready Interrupt</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>USBHS Status Register</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>PHYRDY</name>
                        <description>PHY Is Ready for USBCORE Activity</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PHYON</name>
                        <description>Power On of PHY Complete</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>VREGRDY</name>
                        <description>USB Voltage Regulator Status</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>USBHS Syncbusy Register</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software reset busy bit</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable busy bit</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>T1MSEN</name>
                        <description>T1MS enable busy bit</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FADDR</name>
                  <description>Function Address Register</description>
                  <addressOffset>0x1000</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>FUNCADDR</name>
                        <description>Function address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>POWR</name>
                  <description>Used For Controlling Suspend And Resume Signaling And Some Basic Operation Of USBCORE</description>
                  <addressOffset>0x1001</addressOffset>
                  <size>8</size>
                  <resetValue>0x20</resetValue>
                  <fields>
                     <field>
                        <name>SUSPEN</name>
                        <description>set by the cpu to enable suspendm output</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SUSPMODE</name>
                        <description>set by cpu to enter suspend mode</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESUME</name>
                        <description>set by cpu to generate resume signaling when te device is in suspend</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESET</name>
                        <description>this bit is set when reset signaling is present on the bus</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HSMODE</name>
                        <description>when set this read only bit indicates high speed mode successfully negotiated during usb reset</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HSEN</name>
                        <description>when set by cpu the usbcore will negotiate the high speed mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOFTCONN</name>
                        <description>if enabled the D+ D- lines are enabled when this bit is set by the cpu</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ISOUPD</name>
                        <description>when set by cpu the usbcore will wait for an sof token</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTRTX</name>
                  <description>Read Only Register Which Indicates Which Interrupts Are Currently Active For EP0 And TX EP1-15</description>
                  <addressOffset>0x1002</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <readAction>modify</readAction>
                  <fields>
                     <field>
                        <name>EP0TX</name>
                        <description>Interrupts Active For TX0 Endpoint</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP1TX</name>
                        <description>Interrupts Active For TX1 Endpoint</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP2TX</name>
                        <description>Interrupts Active For TX2 Endpoint</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP3TX</name>
                        <description>Interrupts Active For TX3 Endpoint</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP4TX</name>
                        <description>Interrupts Active For TX4 Endpoint</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP5TX</name>
                        <description>Interrupts Active For TX5 Endpoint</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP6TX</name>
                        <description>Interrupts Active For TX6 Endpoint</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP7TX</name>
                        <description>Interrupts Active For TX7 Endpoint</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTRRX</name>
                  <description>Read Only Register Which Indicates Which Interrupts Are Currently Active For RX EP1-15</description>
                  <addressOffset>0x1004</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <readAction>modify</readAction>
                  <fields>
                     <field>
                        <name>EP1RX</name>
                        <description>Interrupts Active For Which RX1 Endpoint</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP2RX</name>
                        <description>Interrupts Active For Which RX2 Endpoint</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP3RX</name>
                        <description>Interrupts Active For Which RX3 Endpoint</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP4RX</name>
                        <description>Interrupts Active For Which RX4 Endpoint</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP5RX</name>
                        <description>Interrupts Active For Which RX5 Endpoint</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP6RX</name>
                        <description>Interrupts Active For Which RX6 Endpoint</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP7RX</name>
                        <description>Interrupts Active For Which RX7 Endpoint</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
